package by.it.meshchenko.jd03_01;

public class Runner03_01 {
    // А.
    //  Установите или запустите MySQL+удобную для вас СУБД
    //  Разработайте таблицы курсового проекта. Нарисуйте схему данных и связи
    // между таблицами. Должна быть таблица пользователей. Проследите чтобы все
    // таблицы были 3НФ.
    //  Разработайте и заполните данными таблицы для вашего курсового проекта.
    // Добавьте через СУБД или через SQL-команду 1 пользователя и не менее 3
    // принадлежащих ему записей в других таблицах. В таблицах должны быть
    // связи -учитывайте их. Классы назовите A_AddUser и A_AddData.

    // B.
    //  Предусмотрите две (или более) различные роли для пользователей вашего
    // приложения (пользователь+администратор, работник+директор, рабочий+бригадир и
    // т. д.). Создайте дополнительную таблицу ролей пользователей. Добавьте
    // пользователей всех типов. Выведите список пользователей на консоль
    // средствами Java с их ролями. Для получения роли используйте отдельный
    // SQL-запрос (т.е. не объединяйте таблицы через JOIN)
    //  Если вариант В выполнить сразу не получится, сделайте его позднее.
    // Роли пользователей все равно потребуются. Классы назовите B_AddRoles и
    // B_ShowUsers. Откорректируйте классы созданные ранее с учетом новых
    // возможностей или установите в базе значение по умолчанию для роли с
    // наименьшими правами (установите default значение для fk_role).

    // C.
    //  Создайте Java-сценарий, полностью повторяющий проделанную Вами работу по
    // созданию и наполнению базы. Создайте также обратный сценарий удаления всех
    // данных из базы, включая таблицы. Классы назовите C_Init(создание базы) и
    // C_Reset(удаление таблиц)
}
