package by.it.halai.jd01_06;

/**
 * @author Vitaly Halai
 */
class Data {
    static final String TXT =
            "У лукоморья дуб зеленый;\n" +
                    "Златая цепь на дубе том:\n" +
                    "И днем и ночью кот ученый\n" +
                    "Всё ходит по цепи кругом;\n" +
                    "Идет направо — песнь заводит,\n" +
                    "Налево — сказку говорит.\n" +
                    "\n" +
                    "Там чудеса: там леший бродит,\n" +
                    "Русалка на ветвях сидит;\n" +
                    "Там на неведомых дорожках\n" +
                    "Следы невиданных зверей;\n" +
                    "Избушка там на курьих ножках\n" +
                    "Стоит без окон, без дверей;\n" +
                    "Там лес и дол видений полны;\n" +
                    "Там о заре прихлынут волны\n" +
                    "На брег песчаный и пустой,\n" +
                    "И тридцать витязей прекрасных\n" +
                    "Чредой из вод выходят ясных,\n" +
                    "И с ними дядька их морской;\n" +
                    "Там королевич мимоходом\n" +
                    "Пленяет грозного царя;\n" +
                    "Там в облаках перед народом\n" +
                    "Через леса, через моря\n" +
                    "Колдун несет богатыря;\n" +
                    "В темнице там царевна тужит,\n" +
                    "А бурый волк ей верно служит;\n" +
                    "Там ступа с Бабою Ягой\n" +
                    "Идет, бредет сама собой;";
}
